{
    "data": 
    [
        {
            "id": 0,
            "year": 2010,
            "content":
            [
                {
                    "title": "Startet på en selvstyrt reise for å lære webutvikling",

                    "tech": ["HTML", "CSS"],

                    "description":
                    {
                        "summary": "Gjennom denne fasen lærte jeg meg grunnleggende HTML's beste praksiser og hvordan man bruker sematisk HTML elementer effektivt og hvordan man legger til CSS stiler på HTML elementene."
                    }
                    
                }
            ]
        },
        {
            "id": 1,
            "year": 2020,

            "content":
            [
                {
                    "title": "Dykke inn i en verden av backend",
                    "tech": ["discord.py", "numpy.py", "pandas.py", "django.py"],
                    "description":
                    {
                        "summary": "I denne fasen begynte jeg å lære om backend-utvikling, Startet med python, gjennom boken 'How To Learn Python Within One Day - Migel Firtsman', Videre fortsatte jeg med integrering av Discord bots."
                    }
                }
            ]
        },
        {
            "id": 2,
            "year": 2024,

            "content":
            [
                {
                    "title": "Starten på forfølgelsen av drømmen",
                    "description":
                    {
                        "summary": "Denne fasen markerer begynnelsen på den profesjonelle reisen min som utvikler."
                    }
                }
            ]
        },
        {
            "id": 3,
            "year": 2025,
            "content":
            [
                {
                    "title": "Min første jobb som utvikler",
                    "tech": ["ASP.NET", ".NET", "SASS", "TypeScript", "Entity Framework"],
                    "description":
                    {
                        "summary": "Dette året markerte min inntreden i arbeidslivet som utvikler. I denne arbeidsplassen fikk jeg utvikle ferdigheter med teknologier som TypeScript for frontend og C# for backend. Jeg utviklet også kunnskapen om mermaid.js (UML) for å visualisere og dokumentere backend-strukturen. I tillegg utviklet jeg en erfaring med nyere teknologier som Headless CMS, utvidet min kompentanse innen for feltet."
                    }
                },
                {
                    "title": "Mitt første prosjekt som frilanser",

                    "tech": ["Vue.js", "flask.py"],
                    "description":
                    {
                        "summary": "Denne delen av min reise, fikk jeg muligheten til å arbeide med et prosjekt for SosEnt, hvor jeg fikk muligheten til å få erfaringer knyttet til:",
                        "list":
                        [
                            "Tidsstyring",
                            "Kundesamarbeid og kommunikasjon",
                            "Anbefaling av teknologier og verktøy",
                            "Planleggingsprosessen og UML dokumentasjon"
                            
                        ]
                    }
                }
            ]
        }
    ]
}
